Обработки/Reports/_НачислениеНКДдляЦелейНалогобложения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_НачислениеНКДдляЦелейНалогобложения</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Переоценка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПереоценкаЦенныхБумаг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подписант</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_НачислениеНКДдляЦелейНалогобложения/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПодписантНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Параметрыформы = РаботаСОтчетами.ПолучитьПараметрыФормыВыбораКонтактногоЛица(Новый Структура("Организация, КонтактноеЛицо", Отчет.Организация, Отчет.Подписант));
	
	ОткрытьФормуМодально("РегистрСведений.КонтактныеЛица.ФормаСписка", ПараметрыФормы, Элемент, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодписантОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтруктураДанныхКонтактногоЛица = Неопределено;	
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.ЮрФизЛица") Тогда
		СтруктураДанныхКонтактногоЛица = РаботаСОтчетами.ПолучитьДанныеКонтактногоЛица(ВыбранноеЗначение, Отчет.Организация);
	ИначеЕсли ТипЗнч(ВыбранноеЗначение) = Тип("РегистрСведенийКлючЗаписи.КонтактныеЛица") Тогда
		СтруктураДанныхКонтактногоЛица = РаботаСОтчетами.ПолучитьДанныеКонтактногоЛицаПоКлючу(ВыбранноеЗначение);
	КонецЕсли;	
		
	Если Не РаботаСОтчетамиКлиентСервер.ПроверитьСтруктуруДанныхКонтактногоЛица(СтруктураДанныхКонтактногоЛица) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Выбрано некорректное значение!");
		ВыбранноеЗначение = Неопределено;
		Возврат;
	КонецЕсли;
	
	ВыбранноеЗначение = СтруктураДанныхКонтактногоЛица.КонтактноеЛицо;
	
	Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("СтруктураДанныхКонтактногоЛица", СтруктураДанныхКонтактногоЛица);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодписантПриИзменении(Элемент)

	Если Не ЗначениеЗаполнено(Отчет.Подписант) Тогда
		Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("СтруктураДанныхКонтактногоЛица", Неопределено);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);
	
	ЭтаФорма.Отчет.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	
	ЭтаФорма.Отчет.Период.ДатаОкончания = КонецМесяца(ДобавитьМесяц(ТекущаяДата(),-1));
	ЭтаФорма.Отчет.Период.ДатаНачала    = НачалоМесяца(ДобавитьМесяц(ТекущаяДата(),-1));
	
	Параметры.Свойство("НастройкиОтчета", ЭтаФорма.НастройкиОтчета);

КонецПроцедуры

&НаСервере
Процедура КомандаСформироватьОтчетНаСервере()
		
	РеквизитФормыВЗначение("Отчет").СформироватьОтчет(ЭтотОбъект.РезультатГос, ЭтотОбъект.РезультатКорп20, ЭтотОбъект.РезультатКорп15, ЭтотОбъект.РезультатЕвро);	
	
КонецПроцедуры	

&НаКлиенте
Процедура КомандаСформироватьОтчет(Команда)
	
	Если Не ЭтаФорма.ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Отчет.Переоценка) Тогда    	
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Нет переоценки на выбранную дату");
	КонецЕсли;
	
	КомандаСформироватьОтчетНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ОпределитьПереоценку()
	
	//Если ЭтаФорма.ПроверитьЗаполнение() Тогда
		
		ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
		ОтчетОбъект.ОпределитьПереоценку();
		ЗначениеВРеквизитФормы(ОтчетОбъект, "Отчет");
		
	//КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	ОпределитьПереоценку();
	
КонецПроцедуры

&НаКлиенте 
Процедура АвтоматическоеФормирование() Экспорт

	ЗаполнитьЗначенияСвойств(Отчет, ЭтаФорма.НастройкиОтчета);
	
	Отчет.Подписант = ЭтаФорма.НастройкиОтчета.Подписант.КонтактноеЛицо;
	ЭтаФорма.Отчет.Период      =  ЭтаФорма.НастройкиОтчета.Период;
	
	ОпределитьПереоценку();
	
	Если Не ЗначениеЗаполнено(Отчет.Переоценка) Тогда    	
		Возврат;	
	КонецЕсли;
	
	КомандаСформироватьОтчетНаСервере();	
		
	КнигаЭксель = Новый ПакетОтображаемыхДокументов;
	Элемент1 = КнигаЭксель.Состав.Добавить(ПоместитьВоВременноеХранилище(ЭтаФорма.РезультатГос, УникальныйИдентификатор));		
	Элемент1.Наименование = "Государственные";
		
	Элемент2 = КнигаЭксель.Состав.Добавить(ПоместитьВоВременноеХранилище(ЭтаФорма.РезультатКорп20, УникальныйИдентификатор));
	Элемент2.Наименование = "Корпоративные 20%";
		
	Элемент3 = КнигаЭксель.Состав.Добавить(ПоместитьВоВременноеХранилище(ЭтаФорма.РезультатКорп15, УникальныйИдентификатор));
	Элемент3.Наименование = "Корпоративные 15%";		
		
	Элемент4 = КнигаЭксель.Состав.Добавить(ПоместитьВоВременноеХранилище(ЭтаФорма.РезультатЕвро, УникальныйИдентификатор));
	Элемент4.Наименование = "Еврооблигации";		
		
	РаботаСОтчетамиКлиент.АвтоматическоеФормированиеОтчета(ЭтаФорма, КнигаЭксель);						
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ЗначениеЗаполнено(Отчет.Период) И ЗначениеЗаполнено(Отчет.СчетДоверительногоУправления) Тогда
		ОпределитьПереоценку();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	РаботаСФормами.ПриЗагрузкеДанныхИзНастроек(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	ТекстСообщения = "";

	Если Не ОбщегоНазначенияКлиентСервер.ПериодЗаполненКорректно(Отчет.Период,,, ТекстСообщения) Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,, "Отчет.Период");
		Возврат;
	КонецЕсли;

КонецПроцедуры
